# BasicLossFactor Constructor (BasicLossFactor) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BasicLossFactor Constructor (BasicLossFactor)
BasicLossFactor Class See Also
---
Creates a copy of the given basic loss factor object
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public BasicLossFactor(
	BasicLossFactor other
)
```

Visual Basic
---
```text
Public Sub New ( _
	other As BasicLossFactor _
)
```

Visual C++
---
```text
public:
BasicLossFactor(
	BasicLossFactor^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB.Lighting..::..BasicLossFactor
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
BasicLossFactor Class
BasicLossFactor Overload
Autodesk.Revit.DB.Lighting Namespace